/* 
122. Лучшее время для покупки и продажи акций II
Попытка
Середина
Темы
Компании
Вам дан целочисленный массив prices, где prices[i]— цена определенной акции на день.ith

Каждый день вы можете решить купить и/или продать акции. Вы можете держать только одну акцию акций в любой момент времени. Однако вы можете купить ее, а затем немедленно продать в тот же день .

Найдите и получите максимальную прибыль , которую только можете получить .

 

Пример 1:

Вход: цены = [7,1,5,3,6,4]
 Выход: 7
 Объяснение: Купить на 2-й день (цена = 1) и продать на 3-й день (цена = 5), прибыль = 5-1 = 4.
Затем покупаем на 4-й день (цена = 3) и продаем на 5-й день (цена = 6), прибыль = 6-3 = 3.
Общая прибыль составляет 4 + 3 = 7.
Пример 2:

Вход: цены = [1,2,3,4,5]
 Выход: 4
 Объяснение: Купить в день 1 (цена = 1) и продать в день 5 (цена = 5), прибыль = 5-1 = 4.
Общая прибыль составляет 4.
Пример 3:

Вход: цены = [7,6,4,3,1]
 Выход: 0
 Объяснение: нет возможности получить положительную прибыль, поэтому мы никогда не покупаем акции, чтобы получить максимальную прибыль 0.
 

Ограничения:

1 <= prices.length <= 3 * 104
0 <= prices[i] <= 104
*/

function maxProfit(prices: number[]): number {
    let profit = 0;

    for (let i = 1; i < prices.length; i++) {
        if (prices[i] - prices[i - 1] > 0) {
            profit += prices[i] - prices[i - 1]
        }
    }

    return profit;
};
