/*

Решено
Середина
Темы
Компании
Дана входная строка s, необходимо поменять местами слова .

Слово определяется как последовательность непробельных символов. Слова в будут разделены как минимум одним пробелом .s

Возвращает строку слов в обратном порядке, соединенных одним пробелом.

Обратите внимание , что sможет содержать начальные или конечные пробелы или несколько пробелов между двумя словами. Возвращаемая строка должна содержать только один пробел, разделяющий слова. Не включайте никаких дополнительных пробелов.

 

Пример 1:

Вход: s = "небо синее"
 Выход: "небо синее"
Пример 2:

Ввод: s = " hello world "
 Вывод: "world hello"
 Пояснение: Ваша перевернутая строка не должна содержать начальных или конечных пробелов.
Пример 3:

Ввод: s = "a good example"
 Вывод: "example good a"
 Пояснение: Вам необходимо сократить несколько пробелов между двумя словами до одного пробела в перевернутой строке.
 

Ограничения:

1 <= s.length <= 104
sсодержит английские буквы (заглавные и строчные), цифры и пробелы ' '.
В языке есть по крайней мере одно слово s.
 

Продолжение:  Если тип данных string в вашем языке изменяем, можно ли решить эту проблему  на месте  с помощью  O(1) дополнительного пространства?
*/

function reverseWords(s: string): string {
    let newArr = s.trim().split(" ").reverse();
    for (let i = 0; i < newArr.length; i++) {
        if (!newArr[i]) {
            newArr.splice(i, 1);
            i--;
        }
    }

    return newArr.join(" ");
};



//v2 

function reverseWords(s: string): string {
    return s.split(" ").reverse().filter(str => str).join(" ");
};