/*
58. Длина последнего слова
Решено
Легкий
Темы
Компании
Для заданной строки, sсостоящей из слов и пробелов, вернуть длину последнего слова в строке.

Слово — это максимум
подстрока
состоящий только из символов, не являющихся пробелами.

 

Пример 1:

Ввод: s = "Hello World"
 Вывод: 5
 Пояснение: Последнее слово — "World" длиной 5.
Пример 2:

Ввод: s = "Отправь меня на луну"
 Вывод: 4
 Пояснение: Последнее слово - "луна" длиной 4.
Пример 3:

Ввод: s = "luffy is still joyboy"
 Вывод: 6
 Пояснение: Последнее слово — "joyboy" длиной 6.
 

Ограничения:

1 <= s.length <= 104
sсостоит только из английских букв и пробелов ' '.
В тексте будет как минимум одно слово s.
 */

function lengthOfLastWord(s: string): number {
    const arr = s.trim().split(" ");
    return arr[arr.length - 1].length;
};

// v2

function lengthOfLastWord(s: string): number {
    return s.trim().split(" ").pop().length
};