/*
71. Упростить путь
Решено
Середина
Темы
Компании
Вам дан абсолютный путь для файловой системы в стиле Unix, который всегда начинается с косой черты '/'. Ваша задача — преобразовать этот абсолютный путь в его упрощенный канонический путь .

Правила файловой системы в стиле Unix следующие:

Одна точка '.'представляет текущий каталог.
Двойная точка '..'обозначает предыдущий/родительский каталог.
Несколько последовательных слешей, например '//'и , '///'рассматриваются как один слеш '/'.
Любая последовательность точек, которая не соответствует правилам выше, должна рассматриваться как допустимое имя каталога или файла . Например, и являются допустимыми именами каталогов или файлов.'...' '....'
Упрощенный канонический путь должен соответствовать следующим правилам :

Путь должен начинаться с одной косой черты '/'.
Каталоги в пути должны быть разделены ровно одной косой чертой '/'.
Путь не должен заканчиваться косой чертой '/', если только это не корневой каталог.
Путь не должен содержать одинарных или двойных точек ( '.'и '..'), используемых для обозначения текущего или родительского каталога.
Верните упрощенный канонический путь .

 

Пример 1:

Ввод: путь = "/home/"

Вывод: "/home"

Объяснение:

Завершающую косую черту следует удалить.

Пример 2:

Ввод: путь = "/home//foo/"

Вывод: "/home/foo"

Объяснение:

Несколько последовательных слешей заменяются одним.

Пример 3:

Ввод: путь = "/home/user/Documents/../Pictures"

Вывод: "/home/user/Pictures"

Объяснение:

Двойная точка ".."относится к каталогу на уровень выше (родительскому каталогу).

Пример 4:

Ввод: путь = "/../"

Выход: "/"

Объяснение:

Подъем на один уровень выше из корневого каталога невозможен.

Пример 5:

Ввод: путь = "/.../a/../b/c/../d/./"

Вывод: "/.../b/d"

Объяснение:

"..."является допустимым именем для каталога в этой задаче.

 

Ограничения:

1 <= path.length <= 3000
pathсостоит из английских букв, цифр, точки '.', косой черты '/'или '_'.
pathявляется допустимым абсолютным путем Unix.
*/

function simplifyPath(path: string): string {
    let arrPath = path.split("/");
    let stack = [];

    for (let i = 0; i < arrPath.length; i++) {
        if (arrPath[i] === "..") {
            stack.pop();
        } else if (!(arrPath[i] === "" || arrPath[i].includes("/") || arrPath[i] === ".")) {
            stack.push(arrPath[i]);
        }
    }

    return "/" + stack.join("/");
};

// v2
// изначально пошла путем решения через splice, но поняла, что тут скорее всего будет удобнее через stack, ну и набросала за минут 5-10

function simplifyPath(path: string): string {
    let pathArr = path.split("/");
    let stack = [];

    for (let dir of pathArr) {
        if (dir === "." || dir == "") continue;
        if (dir === "..") {
            stack.pop();
            continue;
        }
        stack.push(dir);
    }

    return "/" + stack.join("/");
};