/**
Вам даны два целочисленных массива nums1и nums2, отсортированных в неубывающем порядке , и два целых числа mи n, представляющие количество элементов в nums1и nums2соответственно.

Объединить nums1 в nums2один массив, отсортированный в неубывающем порядке .

Окончательный отсортированный массив не должен возвращаться функцией, а должен храниться внутри массиваnums1 . Чтобы учесть это, nums1имеет длину m + n, где первые mэлементы обозначают элементы, которые должны быть объединены, а последние nэлементы установлены в 0и должны игнорироваться. nums2имеет длину n.

 

Пример 1:

Вход: nums1 = [1,2,3,0,0,0], m = 3, nums2 = [2,5,6], n = 3
 Выход: [1,2,2,3,5,6]
 Пояснение: Массивы, которые мы объединяем, — это [1,2,3] и [2,5,6].
Результатом слияния является [ 1 , 2 , 2, 3 , 5, 6] с подчеркнутыми элементами, взятыми из nums1.
Пример 2:

Ввод: nums1 = [1], m = 1, nums2 = [], n = 0
 Вывод: [1]
 Пояснение: Массивы, которые мы объединяем, — это [1] и [].
Результатом слияния является [1].
Пример 3:

Ввод: nums1 = [0], m = 0, nums2 = [1], n = 1
 Вывод: [1]
 Пояснение: Массивы, которые мы объединяем, — это [] и [1].
Результатом слияния является [1].
Обратите внимание, что поскольку m = 0, в nums1 нет элементов. 0 присутствует только для того, чтобы результат слияния мог поместиться в nums1.
 

Ограничения:

nums1.length == m + n
nums2.length == n
0 <= m, n <= 200
1 <= m + n <= 200
-109 <= nums1[i], nums2[j] <= 109
 

Продолжение: Можете ли вы придумать алгоритм, работающий во O(m + n)времени?
 */

function merge(nums1: number[], m: number, nums2: number[], n: number): void {
    let h = 0;

    for (let i = m; i < nums1.length; i++) {
        if (nums1[i] === 0) {
            nums1[i] = nums2[h]
            h += 1;
        }
    }

    nums1.sort((a, b) => (a - b))
};


// v2

function merge(nums1: number[], m: number, nums2: number[], n: number): void {
    let p1 = m - 1;
    let p2 = n - 1;
    let p = nums1.length - 1;

    while (p2 >= 0) {
        if (p1 >= 0 && nums1[p1] >= nums1[p2]) {
            nums1[p] = nums1[p1];
            p1--;
        } else {
            nums1[p] = nums2[p2];
            p2--;
        }

        p--;
    }

    nums1.sort((a, b) => a - b)
};
